In [14]:
import pandas as pd
import numpy as np

In [97]:
#u_data-> dataframe으로 변경
u_data = []
with open('./ml-100k/u.data','r',encoding='UTF-8') as f:
    for line in f.readlines():
        u_data.append(line.strip().split('\t'))
    
u_data = pd.DataFrame(u_data, columns=["userID","itemID","rating","timestamp"])  
u_data.head()

  userID itemID rating  timestamp
0    196    242      3  881250949
1    186    302      3  891717742
2     22    377      1  878887116
3    244     51      2  880606923
4    166    346      1  886397596

In [104]:
#u.item -> dataframe으로 변경
u_item = []
with open("./ml-100k/u.item",'r',encoding='ISO-8859-1') as f:
    for line in f.readlines():
        u_item.append(line.strip().split("|")[:-4]) #README에서 item의 컬럼은 20개 였으나 해당 데이터에는 24개의 컬럼이 존재하여 4개의 컬럼을 제외시켰습니다
        

        
movies_info = """movie id | movie title | release date | video release date |
IMDb URL | unknown | Action | Adventure | Animation |
Children's | Comedy | Crime | Documentary | Drama | Fantasy |
Film-Noir | Horror | Musical | Mystery | Romance | Sci-Fi |
Thriller | War | Western"""        
        
movies_info = movies_info.split(" | ")    

u_item = pd.DataFrame(u_item,columns=movies_info)
u_item

,movie id,movie title,release date,video release date |\nIMDb URL,unknown,Action,Adventure,Animation |\nChildren's,Comedy,Crime,Documentary,Drama,Fantasy |\nFilm-Noir,Horror,Musical,Mystery,Romance,Sci-Fi |\nThriller,War,Western
0,1,Toy Story (1995),01-Jan-1995,,http://us.imdb.com/M/title-exact?Toy%20Story%2...,0,0,0,1,1,1,0,0,0,0,0,0,0,0,0
1,2,GoldenEye (1995),01-Jan-1995,,http://us.imdb.com/M/title-exact?GoldenEye%20(...,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0
2,3,Four Rooms (1995),01-Jan-1995,,http://us.imdb.com/M/title-exact?Four%20Rooms%...,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
3,4,Get Shorty (1995),01-Jan-1995,,http://us.imdb.com/M/title-exact?Get%20Shorty%...,0,1,0,0,0,1,0,0,1,0,0,0,0,0,0
4,5,Copycat (1995),01-Jan-1995,,http://us.imdb.com/M/title-exact?Copycat%20(1995),0,0,0,0,0,0,1,0,1,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1677,1678,Mat' i syn (1997),06-Feb-1998,,http://us.imdb.com/M/title-exact?Mat%27+i+syn+...,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0
1678,1679,B. Monkey (1998),06-Feb-1998,,http://us.imdb.com/M/title-exact?B%2E+Monkey+(...,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1
1679,1680,Sliding Doors (1998),01-Jan-1998,,http://us.imdb.com/Title?Sliding+Doors+(1998),0,0,0,0,0,0,0,0,1,0,0,0,0,0,1
1680,1681,You So Crazy (1994),01-Jan-1994,,http://us.imdb.com/M/title-exact?You%20So%20Cr...,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0
1681,1682,Scream of Stone (Schrei aus Stein) (1991),08-Mar-1996,,http://us.imdb.com/M/title-exact?Schrei%20aus%...,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0

In [99]:
#u.user -> dataframe으로 변경
u_user = []
with open("./ml-100k/u.user",'r',encoding='UTF-8') as f:
    for line in f.readlines():
        u_user.append(line.strip().split("|")) 
        
user_info = """user id | age | gender | occupation | zip code"""        
        
user_info = user_info.split(" | ")    

u_user = pd.DataFrame(u_user,columns=user_info)
u_user

    user id age gender     occupation zip code
0         1  24      M     technician    85711
1         2  53      F          other    94043
2         3  23      M         writer    32067
3         4  24      M     technician    43537
4         5  33      F          other    15213
..      ...  ..    ...            ...      ...
938     939  26      F        student    33319
939     940  32      M  administrator    02215
940     941  20      M        student    97229
941     942  48      F      librarian    78209
942     943  22      M        student    77841

[943 rows x 5 columns]

In [100]:
#u.genre ->dataframe으로 변경
genre=[]
with open("./ml-100k/u.genre",'r',encoding='UTF-8') as f:
    for line in f.readlines():
        genre.append(line.strip().split("|")) 
genre = pd.DataFrame(genre,columns=["genre_name","genre_ID"]) #어차피 Index와 Genre_ID가 같음 나중에 없애봐
print(genre)

#u.occupation-> dataframe으로 변경
occupation =[]
with open("./ml-100k/u.occupation", 'r',encoding='UTF-8') as f:
    for line in f.readlines():
        occupation.append(line.strip().split("|"))
        
occupation = pd.DataFrame(occupation,columns=["job"])
occupation

     genre_name genre_ID
0       unknown        0
1        Action        1
2     Adventure        2
3     Animation        3
4    Children's        4
5        Comedy        5
6         Crime        6
7   Documentary        7
8         Drama        8
9       Fantasy        9
10    Film-Noir       10
11       Horror       11
12      Musical       12
13      Mystery       13
14      Romance       14
15       Sci-Fi       15
16     Thriller       16
17          War       17
18      Western       18
19                  None

              job
0   administrator
1          artist
2          doctor
3        educator
4        engineer
5   entertainment
6       executive
7      healthcare
8       homemaker
9          lawyer
10      librarian
11      marketing
12           none
13          other
14     programmer
15        retired
16       salesman
17      scientist
18        student
19     technician
20         writer

In [134]:
# 1.전체이용자에서 가장 시청률이 높은 영화 TOP 100
result = u_data.value_counts(subset="itemID", ascending=False)

result = pd.DataFrame(result)
top_id = result.index[:100] #영화 TOP 100 ID

print("1. 전체 사용자에서 가장 시청률이 높은 영화 TOP 100\n")

for idx in range(100):
    name =  u_item.loc[u_item['movie id']==top_id[idx],"movie title"].values[0]
    print("{0}등 영화 제목 : {1}".format(idx+1,name))

1. 전체 사용자에서 가장 시청률이 높은 영화 TOP 100

1등 영화 제목 : Star Wars (1977)
2등 영화 제목 : Contact (1997)
3등 영화 제목 : Fargo (1996)
4등 영화 제목 : Return of the Jedi (1983)
5등 영화 제목 : Liar Liar (1997)
6등 영화 제목 : English Patient, The (1996)
7등 영화 제목 : Scream (1996)
8등 영화 제목 : Toy Story (1995)
9등 영화 제목 : Air Force One (1997)
10등 영화 제목 : Independence Day (ID4) (1996)
11등 영화 제목 : Raiders of the Lost Ark (1981)
12등 영화 제목 : Godfather, The (1972)
13등 영화 제목 : Pulp Fiction (1994)
14등 영화 제목 : Twelve Monkeys (1995)
15등 영화 제목 : Silence of the Lambs, The (1991)
16등 영화 제목 : Jerry Maguire (1996)
17등 영화 제목 : Rock, The (1996)
18등 영화 제목 : Empire Strikes Back, The (1980)
19등 영화 제목 : Star Trek: First Contact (1996)
20등 영화 제목 : Back to the Future (1985)
21등 영화 제목 : Titanic (1997)
22등 영화 제목 : Mission: Impossible (1996)
23등 영화 제목 : Fugitive, The (1993)
24등 영화 제목 : Indiana Jones and the Last Crusade (1989)
25등 영화 제목 : Willy Wonka and the Chocolate Factory (1971)
26등 영화 제목 : Princess Bride, The (1987)
27등 영화 제목 : Forrest Gump (1994)
28등 영화 제목 : Saint, The (1997)
29등 영화 제목 : Monty Python and the Holy Grail (1974)
30등 영화 제목 : Full Monty, The (1997)
31등 영화 제목 : Men in Black (1997)
32등 영화 제목 : Terminator, The (1984)
33등 영화 제목 : E.T. the Extra-Terrestrial (1982)
34등 영화 제목 : Dead Man Walking (1995)
35등 영화 제목 : Schindler's List (1993)
36등 영화 제목 : Leaving Las Vegas (1995)
37등 영화 제목 : L.A. Confidential (1997)
38등 영화 제목 : Braveheart (1995)
39등 영화 제목 : Conspiracy Theory (1997)
40등 영화 제목 : Terminator 2: Judgment Day (1991)
41등 영화 제목 : Mr. Holland's Opus (1995)
42등 영화 제목 : Birdcage, The (1996)
43등 영화 제목 : Twister (1996)
44등 영화 제목 : Alien (1979)
45등 영화 제목 : When Harry Met Sally... (1989)
46등 영화 제목 : Aliens (1986)
47등 영화 제목 : Shawshank Redemption, The (1994)
48등 영화 제목 : Jaws (1975)
49등 영화 제목 : Groundhog Day (1993)
50등 영화 제목 : Amadeus (1984)
51등 영화 제목 : Apollo 13 (1995)
52등 영화 제목 : Blade Runner (1982)
53등 영화 제목 : Truth About Cats & Dogs, The (1996)
54등 영화 제목 : Sense and Sensibility (1995)
55등 영화 제목 : Usual Suspects, The (1995)
56등 영화 제목 : Ransom (1996)
57등 영화 제목 : One Flew Over the Cuckoo's Nest (1975)
58등 영화 제목 : Jurassic Park (1993)
59등 영화 제목 : 2001: A Space Odyssey (1968)
60등 영화 제목 : Evita (1996)
61등 영화 제목 : Raising Arizona (1987)
62등 영화 제목 : Dances with Wolves (1990)
63등 영화 제목 : Chasing Amy (1997)
64등 영화 제목 : Broken Arrow (1996)
65등 영화 제목 : Dead Poets Society (1989)
66등 영화 제목 : Blues Brothers, The (1980)
67등 영화 제목 : Four Weddings and a Funeral (1994)
68등 영화 제목 : Game, The (1997)
69등 영화 제목 : Trainspotting (1996)
70등 영화 제목 : Fish Called Wanda, A (1988)
71등 영화 제목 : Wizard of Oz, The (1939)
72등 영화 제목 : Phenomenon (1996)
73등 영화 제목 : Star Trek: The Wrath of Khan (1982)
74등 영화 제목 : Die Hard (1988)
75등 영화 제목 : Casablanca (1942)
76등 영화 제목 : Sting, The (1973)
77등 영화 제목 : Dante's Peak (1997)
78등 영화 제목 : Devil's Own, The (1997)
79등 영화 제목 : Graduate, The (1967)
80등 영화 제목 : Psycho (1960)
81등 영화 제목 : Seven (Se7en) (1995)
82등 영화 제목 : Time to Kill, A (1996)
83등 영화 제목 : It's a Wonderful Life (1946)
84등 영화 제목 : In & Out (1997)
85등 영화 제목 : Speed (1994)
86등 영화 제목 : Hunt for Red October, The (1990)
87등 영화 제목 : Stand by Me (1986)
88등 영화 제목 : GoodFellas (1990)
89등 영화 제목 : Heat (1995)
90등 영화 제목 : Sound of Music, The (1965)
91등 영화 제목 : Clockwork Orange, A (1971)
92등 영화 제목 : Apocalypse Now (1979)
93등 영화 제목 : Courage Under Fire (1996)
94등 영화 제목 : Top Gun (1986)
95등 영화 제목 : Lion King, The (1994)
96등 영화 제목 : Volcano (1997)
97등 영화 제목 : Aladdin (1992)
98등 영화 제목 : To Kill a Mockingbird (1962)
99등 영화 제목 : Babe (1995)
100등 영화 제목 : Murder at 1600 (1997)

In [113]:
#u_item[u_item['itemID'] == '71']
u_item.loc[u_item['movie id']=='1',"movie title"]

0    Toy Story (1995)
Name: movie title, dtype: object